Tekla Open API Reference for Tekla Structures 2025
AnalysisArea.Material Property
 Gets or sets the material of the analysis area.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisMaterial Material { get; set; }
Public Property Material As AnalysisMaterial
	Get
	Set
Property Value
Type: AnalysisMaterial
See Also
Reference
AnalysisArea Class
Tekla.Structures.Analysis Namespace